app/Controllers/Categorias.php

	public function index($activo = '1')
	{
		$categorias = $this->categorias->where('activo', $activo)->findAll();
---
SELECT *
FROM "pos"."categorias"
WHERE "activo" = '1'

	public function eliminados($activo = '0')
	{
		$categorias = $this->categorias->where('activo', $activo)->findAll();
---
SELECT *
FROM "pos"."categorias"
WHERE "activo" = '0'