app/Controllers/Clientes.php

SELECT *
FROM "pos"."clientes"
WHERE "activo" = '1'
---
	public function index($activo = '1')
	{
		$clientes = $this->clientes->where('activo', $activo)->findAll();