app/Controllers/Productos.php

SELECT *
FROM "pos"."productos"
WHERE "activo" = '1'
---
	public function index($activo = '1')
	{
		$productos = $this->productos->where('activo', $activo)->findAll();

SELECT *
FROM "pos"."productos"
WHERE "activo" = '1'
---
	public function eliminados($activo = '0')
	{
		$productos = $this->productos->where('activo', $activo)->findAll();

SELECT *
FROM "pos"."categorias"
WHERE "activo" = '1'
SELECT *
FROM "pos"."unidades"
WHERE "activo" = '1'
---
	public function nuevo()
	{
		$categorias = $this->categorias->where('activo', '1')->findAll();
		$unidades = $this->unidades->where('activo', '1')->findAll();