app/Controllers/Unidades.php

	public function index($activo = '1')
	{
		$unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM "pos"."unidades"
WHERE "activo" = '1'

	public function eliminados($activo = '0')
	{
		$unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM "pos"."unidades"
WHERE "activo" = '1'