app/Controllers/Usuarios.php

SELECT *
FROM "pos"."usuarios"
WHERE "activo" = '1'
---
	public function index($activo = '1')
	{
		$usuarios = $this->usuarios->where('activo', $activo)->findAll();